Revit 2027 API
RevitCommandId.Id Property
 The command id.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public uint Id { get; }
Public ReadOnly Property Id As UInteger
	Get
public:
property unsigned int Id {
	unsigned int get ();
}
member Id : uint32 with get
Property Value
UInt32
See Also
Reference
RevitCommandId Class
Autodesk.Revit.UI Namespace